## Plan Result (user-list-search-production)

[CI link](https://github.com/Pocket/pocket-monorepo/actions/runs/11807384007)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!


<pre><code>Plan: 5 to add, 5 to change, 5 to destroy.</code></pre>

* Update
  * aws_sqs_queue_policy.corpus_events_hydration_sqs_policy
  * aws_sqs_queue_policy.corpus_events_sns_topic_dlq_policy
  * aws_sqs_queue_policy.corpus_events_sqs_policy
  * aws_sqs_queue_policy.user_events_sns_topic_dlq_policy
  * aws_sqs_queue_policy.user_events_sqs_policy
* Replace
  * aws_sns_topic_subscription.collection_events_hydration_sns_topic_subscription
  * aws_sns_topic_subscription.collection_events_sns_topic_subscription
  * aws_sns_topic_subscription.corpus_events_hydration_sns_topic_subscription
  * aws_sns_topic_subscription.corpus_events_sns_topic_subscription
  * aws_sns_topic_subscription.user_events_sns_topic_subscription



<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_sns_topic_subscription.collection_events_hydration_sns_topic_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "collection_events_hydration_sns_topic_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:ba178c6e-c9cd-44d5-a768-8478759a7788" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:ba178c6e-c9cd-44d5-a768-8478759a7788" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.collection_events_sns_topic_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "collection_events_sns_topic_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:0a23e62f-d6f8-474e-a640-02d54848598b" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:0a23e62f-d6f8-474e-a640-02d54848598b" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.corpus_events_hydration_sns_topic_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "corpus_events_hydration_sns_topic_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic:dd1b7093-ed53-41d9-bc96-bfe400cf9dcd" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic:dd1b7093-ed53-41d9-bc96-bfe400cf9dcd" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents" # forces replacement
        # (11 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.corpus_events_sns_topic_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "corpus_events_sns_topic_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic:95ac785f-1b3b-48e1-bf91-4f8583bd6ebd" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic:95ac785f-1b3b-48e1-bf91-4f8583bd6ebd" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sns_topic_subscription.user_events_sns_topic_subscription must be replaced
-/+ resource "aws_sns_topic_subscription" "user_events_sns_topic_subscription" {
      ~ arn                             = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:7d361d54-6087-4b39-815b-db0b0d7aedae" -> (known after apply)
      ~ confirmation_was_authenticated  = true -> (known after apply)
      + filter_policy_scope             = (known after apply)
      ~ id                              = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:7d361d54-6087-4b39-815b-db0b0d7aedae" -> (known after apply)
      ~ owner_id                        = "996905175585" -> (known after apply)
      ~ pending_confirmation            = false -> (known after apply)
      ~ topic_arn                       = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents" # forces replacement
        # (10 unchanged attributes hidden)
    }

  # aws_sqs_queue_policy.corpus_events_hydration_sqs_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "corpus_events_hydration_sqs_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-CorpusParserHydrator"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.corpus_events_sns_topic_dlq_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "corpus_events_sns_topic_dlq_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-CorpusIndexEvents-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.corpus_events_sqs_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "corpus_events_sqs_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-CorpusEvents"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = [
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEventsTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEvents",
                                  ~ "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CorpusEvents",
                                ]
                            }
                        }
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.user_events_sns_topic_dlq_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user_events_sns_topic_dlq_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-SNS-Topic-DLQ"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_sqs_queue_policy.user_events_sqs_policy will be updated in-place
  ~ resource "aws_sqs_queue_policy" "user_events_sqs_policy" {
        id        = "https://sqs.us-east-1.amazonaws.com/996905175585/UserListSearch-Prod-UserListEvents"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ ArnEquals = {
                              ~ "aws:SourceArn" = "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic" -> "arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEvents"
                            }
                        }
                      - Sid       = ""
                        # (4 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 5 to change, 5 to destroy.
```

</details>









<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":946,"Program":"tfcmt","SHA1":"cdf9b91a99a5d1a14964cd97fdb640e636949946","Target":"user-list-search-production","Vars":{},"WorkflowName":"User List Search"} -->